roam/20201109165742-microarchitettura_ia_32.org
#+title: IA-32
[[file:20201109165841-microarchitecture.org][Microarchitecture]]

* Intel

** 80386
=1985=
Introduzione della microarchitettura/instruction set IA-32
- Primo processore a 32 bit
  + capace di indirizzare 4GB di memoria

** Pentium
=1995=
Ultimo ad usare la microarchitettura IA-32
Sostituita poi da
- p6
- NetBurst

L'instruction set fu mantenuto fino al Pentium 4

* Paginazione
a 2 livelli
Pagine di 4MB per paginazione ad un livello
Pagine di 4KB per paginazione a due livelli
- 32 bit
  - 10 - p1
    + directory delle pagine
    + registro CR3
      - indirizzo di partenza della directory corrente
      - attiva al context switch la tabella del processo in Running
  - 10 - p2
    + tabella delle pagine
  - 12 - d
